Repository: eumel8/docs-i18n
Catalog: doc/myguide/source/locale/*/LC_MESSAGES/sphinx.po
Languages: de

source: Sphinx, the Python Documentation Generator, provides `Internationalization <http://www.sphinx-doc.org/en/stable/intl.html>`__ . The workflow is described :ref:`there <sphinx:intl>`.
de: Sphinx, der Python Dokumentations Generator, stellt `Internationalisierung <http://www.sphinx-doc.org/en/stable/intl.html>`__ zur Verfügung. Der Ablauf ist :ref:`hier <sphinx:intl>` beschrieben.

source: btw: documentation reference can be build with :ref:`intersphinx <sphinx:examples>` Check available options::
de: btw: Dokumentationsreferenz kann gebaut werden mit :ref:`intersphinx <sphinx:examples>` Überprüfe die verfügbaren Optionen::

source: Install requirements::
de: Installationsvoraussetzungen::

source: Init
de: Initialisierung

source: To initial a new documentation project use::
de: Um ein neues Dokumentationsprojekt zu initialisieren::

source: Zanata Project File
de: Zanata Projekt Datei

source: To interact to Zanata server with the client a project configuration file named zanata.xml is required::
de: Um mit dem Zanata-Server zu sprechen, brauch der Client eine Projekt Konfigurationsdatei namens zanata.xml::

source: url must match with url name in zanata.ini
de: Die URL muss mit dem URL Namen in der zanata.ini übereinstimmen::

source: Build gettext files for Zanata::
de: Gettext Dateien bauen für Zanata::

source: Push to server
de: Hochladen zum Server

source: Push pot files to Zanata::
de: Pot Dateien zu Zanata schicken::

source: Normaly self-signed certificate will used in private environment like this. The option --disable-ssl-cert will force the client to connect.
de: Normalerweise wird ein selbst-signiertes Zertifikat im privaten Umfeld wie diesem benutzt. Die Option --disable-ssl-cert bestimmt den Client, sich zu verbinden.

source: Now the translation files are on the server and translatable in the configured languages. If this done you can download it again.
de: Jetzt sind die Übersetzungsdateien auf dem Server und in den konfigurierten Sprachen übersetzbar. Wenn das fertig ist, können sie wieder heruntergeladen werden.

source: Pull from server
de: Herunterladen vom Server

source: Pull po files from Zanata::
de: po Dateien von Zanata laden::

source: Use language option -l de for German files, without that all language files will be download.
de: Benutze -l de für deutsche Übersetzungsdateien, ohne dem werden alle Sprachdateien heruntergeladen.

source: Optional: If you modified the language files locally, you can push them to the server::
de: Optional: Wenn Du lokal Sprachdateien geändert hast, kannst Du diese zum Server hochladen::

source: Build and publish
de: Bauen und Publizieren

source: At the end, build and publish the docs::
de: Und am Ende, bauen und veröffentlichen der Dokumente::

source: Or build and publish slides within hieroglyph module::
de: Oder bauen und veröffentlichen von Folien durch Hieroglyph Modul::
